Repository: Prawin-r/COE-FSD
Catalog: Flutter Task/lib/l10n/app_*.arb
Languages: ta

# app_title
source: TuneWave
ta: ட்யூன்வேவ்

source: Home
ta: முகப்பு

source: Songs
ta: பாடல்கள்

source: Favorites
ta: பிடித்தவை

source: Profile
ta: சுயவிவரம்

source: Play Songs
ta: பாடல்களை இயக்கவும்

# loginFailed
source: Login failed. Please try again.
ta: உள்நுழைவு தோல்வி. மீண்டும் முயற்சிக்கவும்.

# signupFailed
source: Sign up failed. Please try again.
ta: பதிவு தோல்வி. மீண்டும் முயற்சிக்கவும்.

# registrationSuccess
source: Registration Successful
ta: பதிவு வெற்றிகரமாக முடிந்தது

# accountCreated
source: Your account has been created successfully.
ta: உங்கள் கணக்கு வெற்றிகரமாக உருவாக்கப்பட்டது.

source: Input Error
ta: உள்ளீட்டுப் பிழை

# fillAllFields
source: Please fill in all fields.
ta: அனைத்து புலங்களையும் பூர்த்தி செய்யவும்.

source: Invalid Email
ta: தவறான மின்னஞ்சல்

# enterValidEmail
source: Please enter a valid email address.
ta: சரியான மின்னஞ்சல் முகவரியை உள்ளிடவும்.

source: Weak Password
ta: பலவீனமான கடவுச்சொல்

# passwordRequirement
source: Password must be at least 6 characters long.
ta: கடவுச்சொல் குறைந்தது 6 எழுத்துகள் இருக்க வேண்டும்.

# userNotFound
source: No user found with this email.
ta: இந்த மின்னஞ்சலுடன் பயனர் காணப்படவில்லை.

# incorrectPassword
source: Incorrect password. Please try again.
ta: தவறான கடவுச்சொல். மீண்டும் முயற்சிக்கவும்.

# emailAlreadyRegistered
source: This email is already registered.
ta: இந்த மின்னஞ்சல் ஏற்கனவே பதிவுசெய்யப்பட்டுள்ளது.

# chooseStrongerPassword
source: Please choose a stronger password.
ta: மிகவும் வலுவான கடவுச்சொல்லை தேர்வு செய்யவும்.

# unexpectedError
source: An unexpected error occurred. Please try again.
ta: எதிர்பாராத பிழை ஏற்பட்டுள்ளது. மீண்டும் முயற்சிக்கவும்.

source: OK
ta: சரி

source: Welcome to TuneWave
ta: ட்யூன்வேவிற்கு வரவேற்கிறோம்

source: Email
ta: மின்னஞ்சல்

source: Password
ta: கடவுச்சொல்

source: Sign In
ta: உள்நுழைய

# dontHaveAccount
source: Don't have an account? Sign up
ta: கணக்கு இல்லையா? பதிவு செய்யவும்
